# 酒类消费数据 - 数据分组

![](https://github.com/tim530712345/20210626/blob/main/images/3.jpeg?raw=1)

### 加载数据

In [1]:
import pandas as pd
drinks = pd.read_csv('drinks.csv')
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0         AS
1      Albania             89  ...                           4.9         EU
2      Algeria             25  ...                           0.7         AF
3      Andorra            245  ...                          12.4         EU
4       Angola            217  ...                           5.9         AF

[5 rows x 6 columns]

In [2]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

### 查询：哪个大陆(continent)平均消耗的啤酒(beer)更多？

In [3]:
drinks.groupby('continent').beer_servings.mean().sort_values(ascending=False).rename('Beer servings mean')

continent
EU    193.777778
SA    175.083333
OC     89.687500
AF     61.471698
AS     37.045455
Name: Beer servings mean, dtype: float64

### 输出每个大陆(continent)的红酒消耗(wine_servings)的描述性统计值

In [ ]:
drinks.groupby('continent').wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### 打印出每个大陆每种酒类别的消耗平均值

In [ ]:
drinks.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### 打印出每个大陆每种酒类别的消耗中位数

In [ ]:
drinks.groupby('continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### 打印出每个大陆对spirit饮品消耗的平均值，最大值和最小值

In [ ]:
# drinks.groupby('continent').spirit_servings.mean())
# drinks.groupby('continent').spirit_servings.max())
# drinks.groupby('continent').spirit_servings.min())
drinks.groupby('continent').spirit_servings.agg(['mean', 'max', 'min'])

                 mean  max  min
continent
AF          16.339623  152    0
AS          60.840909  326    0
EU         132.555556  373    0
OC          58.437500  254    0
SA         114.750000  302   25

### 查询：中国的啤酒消费在亚洲和全球的排名

In [5]:
china_beer = drinks[drinks.country == 'China'].beer_servings.iloc[0]
print ('中国啤酒消费量: ', china_beer)
print ('中国啤酒消费在亚洲排名: ', (drinks[drinks.continent == 'AS'].beer_servings > china_beer).sum()+1, '/', drinks[drinks.continent == 'AS'].beer_servings.count())
print ('中国啤酒消费在全球排名: ', (drinks['beer_servings'] > china_beer).sum()+1 , '/', drinks['beer_servings'].count())

中国啤酒消费量:  79
中国啤酒消费在亚洲排名:  6 / 44
中国啤酒消费在全球排名:  91 / 193

In [13]:
(drinks[drinks.continent == 'AS'].beer_servings > china_beer).sum()+1

6

79